InformationRegisters/упСтатусыЗапросовУсловийПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упСтатусыЗапросовУсловийПеревозок</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыЗапросаУсловийПеревозки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗапросУсловийПеревозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/упЗапросУсловийПеревозки/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
// Процедура формирует движения регистра "упСтатусыЗапросовУсловийПеревозок".
//
// Параметры:
//  ДополнительныеСвойства - Структура - Свойства.
//	Ссылка - ДокументСсылка - Ссылка на элемент.
//	Движения - КоллекцияДвижений - Набор движений.
//  Реквизиты	- Структура - Реквизиты.
//	Отказ - Булево - Флаг выполнения.
//
Процедура СформироватьДвиженияСтатусЗапросаУсловийПеревозки(ДополнительныеСвойства, Ссылка, Движения, Реквизиты, Отказ) Экспорт
	
	Если Отказ Тогда 
		Возврат; 
	КонецЕсли;
	
	ДвиженияСтатуса = Движения.упСтатусыЗапросовУсловийПеревозок;
			
	Статус				= ДополнительныеСвойства.Статус;
	ЗаписыватьСтатус	= ДополнительныеСвойства.ЗаписыватьСтатус;
	Если ЗаписыватьСтатус Тогда
		ДвиженияСтатуса.Записывать = Истина;
		ДвиженияСтатуса.Прочитать();
				
		ДвижениеСтатуса = ДвиженияСтатуса.Добавить();
		ДвижениеСтатуса.Период      = Реквизиты.Дата;
		ДвижениеСтатуса.Документ    = Ссылка;
		ДвижениеСтатуса.Статус      = Статус;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
